##  ASSIGNMENT DATA CLEANING PANDAS

In [1]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [2]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [3]:
n=10045
for i in range(len(df["FlightNumber"])):
    df["FlightNumber"][i]=n
    n=n+10

<ipython-input-3-7438dba5ad87>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["FlightNumber"][i]=n

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [5]:
From1=[]
To1=[]
for i in df["From_To"]:
    f,i=i.split("_")
    From1.append(f)
    To1.append(i)

In [6]:
From=pd.DataFrame(From1,columns=["From"])

In [7]:
To=pd.DataFrame(To1,columns=["To"])

In [8]:
fromto=pd.concat([From,To],axis=1)

In [9]:
fromto

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [10]:
fromto["From"]=[i.capitalize() for i in fromto["From"]]
fromto["To"]=[i.capitalize() for i in fromto["To"]]

In [11]:
fromto

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [12]:
df.drop(["From_To"],axis=1,inplace=True)

In [13]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [14]:
df=pd.concat([fromto,df],axis=1)

In [15]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [16]:
s=[]
for i in df["RecentDelays"]:
    s.append(len(i))
maximum=max(s)

In [17]:
delay=[]
for i in range(maximum):
    delay.append("delay_"+str(i))

In [18]:
delcol=pd.DataFrame(columns=delay)

In [19]:
a=df["RecentDelays"]

In [20]:
a

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [21]:
for i in a:
    if len(i)<maximum:
        lenn=maximum-len(i)
        for j in range(lenn):
            i.append("nan")

In [22]:
a

0      [23, 47, nan]
1    [nan, nan, nan]
2       [24, 43, 87]
3     [13, nan, nan]
4      [67, 32, nan]
Name: RecentDelays, dtype: object

In [23]:
delay=pd.DataFrame([i for i in a])

In [24]:
delay

     0    1    2
0   23   47  nan
1  nan  nan  nan
2   24   43   87
3   13  nan  nan
4   67   32  nan

In [25]:
c=list(delcol)

In [26]:
delay.columns=[i for i in c]

In [27]:
delay

  delay_0 delay_1 delay_2
0      23      47     nan
1     nan     nan     nan
2      24      43      87
3      13     nan     nan
4      67      32     nan

In [28]:
df.drop(["RecentDelays"],axis=1,inplace=True)

In [29]:
df

       From         To  FlightNumber              Airline
0    London      Paris       10045.0               KLM(!)
1    Madrid      Milan       10055.0    <Air France> (12)
2    London  Stockholm       10065.0  (British Airways. )
3  Budapest      Paris       10075.0       12. Air France
4  Brussels     London       10085.0          "Swiss Air"

In [30]:
final=pd.concat([df,delay],axis=1)

In [31]:
final

,From,To,FlightNumber,Airline,delay_0,delay_1,delay_2
0,London,Paris,10045.0,KLM(!),23,47,nan
1,Madrid,Milan,10055.0,<Air France> (12),nan,nan,nan
2,London,Stockholm,10065.0,(British Airways. ),24,43,87
3,Budapest,Paris,10075.0,12. Air France,13,nan,nan
4,Brussels,London,10085.0,"""Swiss Air""",67,32,nan

In [32]:
aaa=final.pop("Airline")

In [33]:
final.insert(6,"Airline",aaa)

In [34]:
final["FlightNumber"]=final["FlightNumber"].astype("int")

In [35]:
final

,From,To,FlightNumber,delay_0,delay_1,delay_2,Airline
0,London,Paris,10045,23,47,nan,KLM(!)
1,Madrid,Milan,10055,nan,nan,nan,<Air France> (12)
2,London,Stockholm,10065,24,43,87,(British Airways. )
3,Budapest,Paris,10075,13,nan,nan,12. Air France
4,Brussels,London,10085,67,32,nan,"""Swiss Air"""